Revit 2015 API
CompoundStructureLayer Constructor
Overload List
Name | Description
CompoundStructureLayer()
 Creates a compound structure layer using default settings.
CompoundStructureLayer(CompoundStructureLayer)
 Creates a copy of compound structure layer.
CompoundStructureLayer(Double, MaterialFunctionAssignment, ElementId)
 Creates a default compound structure layer based on the given width, function and material element id.
See Also
CompoundStructureLayer Class
CompoundStructureLayer Members
Autodesk.Revit.DB Namespace